---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Transaction..::..Commit Method
Transaction Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Commit()()()() | Commits all changes made to the model during the transaction. |
|  | Commit(FailureHandlingOptions) | Commits all changes made to the model during the transaction. |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace